NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
#ifdef BL_LOG
static const char*              m_state_strs[] =
{
    "FIND FWID",
    "DFU REQ",
    "DFU READY",
    "DFU TARGET",
    "VALIDATE",
    "RELAY CANDIDATE",
    "RELAY"
};
static const char*              m_beacon_type_strs[] =
{
    "FWID",
    "READY_APP",
    "READY_SD",
    "READY_BL"
};
static const char*              m_dfu_type_strs[] =
{
    "NONE",
    "SD",
    "BL",
    "?",
    "APP"
};
#endif

/*****************************************************************************
* Static Functions
*****************************************************************************/
#define SET_STATE(s) set_state(s, __LINE__)
static void set_state(dfu_state_t state, uint16_t line)
{
    m_state = state;
    __LOG(RTT_CTRL_TEXT_GREEN "NEW STATE: %s (L%u)\n", m_state_strs[(uint32_t) state], line);
}

static beacon_type_t state_beacon_type(dfu_type_t transfer_type)
{
    switch (transfer_type)
    {
        case DFU_TYPE_APP:
            return BEACON_TYPE_READY_APP;
        case DFU_TYPE_BOOTLOADER:
            return BEACON_TYPE_READY_BL;
        case DFU_TYPE_SD:
            return BEACON_TYPE_READY_SD;
        default:
            return BEACON_TYPE_FWID;
    }
}

static void keep_alive(void)
{
    bl_evt_t keep_alive_evt;
    keep_alive_evt.type = BL_EVT_TYPE_KEEP_ALIVE;
    bootloader_evt_send(&keep_alive_evt);
}

static void packet_tx_dynamic(dfu_packet_t* p_packet,
    uint32_t length,
    bl_radio_interval_type_t interval_type,
    uint8_t repeats)
{
    static uint8_t tx_slot = 1;
    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = p_packet;
    tx_evt.params.tx.radio.length = length;
    tx_evt.params.tx.radio.interval_type = interval_type;
    tx_evt.params.tx.radio.tx_count = repeats;
    tx_evt.params.tx.radio.tx_slot = tx_slot;
    bootloader_evt_send(&tx_evt);

    if (++tx_slot >= m_tx_slots)
    {
        tx_slot = 1;
    }
}

static bool packet_is_from_serial(void* p_packet)
{
#ifdef SERIAL
    /* serial packets will have the device's own address as source */

    return (memcmp(mesh_packet_get_aligned(p_packet)->addr, (const uint8_t*) &NRF_FICR->DEVICEADDR[0], BLE_GAP_ADDR_LEN) == 0);
#else
    return false;
#endif
}

static bool fwid_union_cmp(fwid_union_t* p_a, fwid_union_t* p_b, dfu_type_t dfu_type)
{
    switch (dfu_type)
    {
        case DFU_TYPE_APP:
            return memcmp(&p_a->app,
                          &p_b->app,
                          sizeof(app_id_t)) == 0;
        case DFU_TYPE_SD:
            return (p_a->sd == p_b->sd);
        case DFU_TYPE_BOOTLOADER:
            return memcmp(&p_a->bootloader,
                          &p_b->bootloader,
                          sizeof(bl_id_t)) == 0;
        default: return false;
    }
}

static bool signature_check(void)
{
    __LOG("Verifying signature... ");
    /* if we don't have a public key we will accept all firmware upgrades. */
    if (m_bl_info_pointers.p_ecdsa_public_key == NULL)
    {
        __LOG("No key (THAT'S OKAY THOUGH)\n");
        return true;
    }

    /* if we have a key, but the transfer isn't signed, we will fail */
    if (m_transaction.signature_length == 0)
    {
        __LOG("No signature (FAILURE)\n");
        return false;
    }

    uint8_t hash[uECC_BYTES];
    sha256_context_t hash_context;
    sha256_init(&hash_context);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.type, 1);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.p_indicated_start_addr, 4);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.length, 4);
    uint8_t padding = 0;
    sha256_update(&hash_context, &padding, 1);

    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_APP);
            break;
        case DFU_TYPE_SD:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_SD);
            break;
        case DFU_TYPE_BOOTLOADER:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_BL);
            break;
        default:
            break;
    }

    dfu_transfer_sha256(&hash_context);

    sha256_final(&hash_context, hash);
    bool success = (bool) (uECC_verify(m_bl_info_pointers.p_ecdsa_public_key, hash, m_transaction.signature));
    if (success)
    {
        __LOG("OK\n");
    }
    else
    {
        __LOG("FAIL\n");
    }
    return success;
}

static bool ready_packet_is_upgrade(dfu_packet_t* p_packet)
{
    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }

    switch (p_packet->payload.state.dfu_type)
    {
        case DFU_TYPE_APP:
            return (p_packet->payload.state.fwid.app.app_id == m_bl_info_pointers.p_fwid->app.app_id &&
                    p_packet->payload.state.fwid.app.company_id== m_bl_info_pointers.p_fwid->app.company_id &&
                    p_packet->payload.state.fwid.app.app_version > m_bl_info_pointers.p_fwid->app.app_version);

        case DFU_TYPE_BOOTLOADER:
            return (p_packet->payload.state.fwid.bootloader.id ==
                    m_bl_info_pointers.p_fwid->bootloader.id &&
                    p_packet->payload.state.fwid.bootloader.ver >
                    m_bl_info_pointers.p_fwid->bootloader.ver);

        case DFU_TYPE_SD:
            return (p_packet->payload.state.fwid.sd ==
                    m_bl_info_pointers.p_fwid->sd);
        default:
            return false;
    }
}

static bool ready_packet_matches_our_req(dfu_packet_t* p_packet)
{
    if (p_packet->payload.state.dfu_type != m_transaction.type && m_transaction.type != DFU_TYPE_NONE)
    {
        return false;
    }

    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }
    return fwid_union_cmp(&p_packet->payload.state.fwid,
                   &m_transaction.target_fwid_union,
                   m_transaction.type);
}

