NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
    SET_STATE(DFU_STATE_VALIDATE);
}

static void start_relay_candidate(dfu_packet_t* p_packet)
{
    m_transaction.authority = p_packet->payload.state.authority;
    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
    m_transaction.target_fwid_union = p_packet->payload.state.fwid;
    SET_STATE(DFU_STATE_RELAY_CANDIDATE);

    beacon_set(state_beacon_type(m_transaction.type));
}

/****************** packet cache ******************/
static bool packet_in_cache(dfu_packet_t* p_packet)
{
    for (uint32_t i = 0; i < PACKET_CACHE_SIZE; ++i)
    {
        if (m_packet_cache[i].type    == p_packet->packet_type &&
            m_packet_cache[i].segment == p_packet->payload.data.segment)
        {
            return true;
        }
    }
    return false;
}

static void packet_cache_put(dfu_packet_t* p_packet)
{
    m_packet_cache[(m_packet_cache_index) & (PACKET_CACHE_SIZE - 1)].type = (dfu_packet_type_t) p_packet->packet_type;
    m_packet_cache[(m_packet_cache_index) & (PACKET_CACHE_SIZE - 1)].segment = p_packet->payload.data.segment;
    m_packet_cache_index++;
}

static void relay_packet(dfu_packet_t* p_packet, uint16_t length)
{
    mesh_packet_t* p_mesh_packet = mesh_packet_get_aligned(p_packet);
    if (!p_mesh_packet)
    {
        if (!mesh_packet_acquire(&p_mesh_packet))
        {
            APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
        }
        mesh_packet_build(
            p_mesh_packet,
            p_packet->packet_type,
            p_packet->payload.data.segment,
            (uint8_t*) &p_packet->payload.data.transaction_id,
            length - 4);
    }
    else
    {
        mesh_packet_ref_count_inc(p_mesh_packet);
    }

    packet_tx_dynamic(p_packet, length, TX_INTERVAL_TYPE_DATA, TX_REPEATS_DATA);
    packet_cache_put(p_packet);
    mesh_packet_ref_count_dec(p_mesh_packet);
}

/*************** Packet handlers ******************/
static void handle_data_packet(dfu_packet_t* p_packet, uint16_t length)
{
    bool do_relay = false;
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        /* check and add to cache */
        if (packet_in_cache(p_packet))
        {
            return;
        }

        if (!(p_packet->payload.data.segment & 0x0F))
        {
            __LOG("RX Data packet #%u\n", p_packet->payload.data.segment);
        }

        if (m_state == DFU_STATE_DFU_READY)
        {
            if (p_packet->payload.start.segment == 0)
            {
                bl_info_segment_t* p_segment = NULL;
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        p_segment = m_bl_info_pointers.p_segment_app;
                        break;
                    case DFU_TYPE_SD:
                        p_segment = m_bl_info_pointers.p_segment_sd;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        p_segment = m_bl_info_pointers.p_segment_bl;
                        break;
                    default:
                        APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
                }

                m_transaction.p_indicated_start_addr = (uint32_t*) p_packet->payload.start.start_address;
                uint32_t start_address = p_packet->payload.start.start_address;
                /* if the host doesn't know the start address, we use start of segment: */
                if (start_address == START_ADDRESS_UNKNOWN)
                {
                    start_address = p_segment->start;
                }

                uint32_t segment_count = ((p_packet->payload.start.length * 4) + (start_address & 0x0F) - 1) / 16 + 1;

                if (p_packet->payload.start.signature_length != 0)
                {
                    segment_count += p_packet->payload.start.signature_length / SEGMENT_LENGTH;
                }
                if (segment_count > 0xFFFF)
                {
                    /* can't have more than 65536 segments in a transmission */
                    segment_count = 0xFFFF;
                }

                m_transaction.segments_remaining                = segment_count;
                m_transaction.segment_count                     = segment_count;
                m_transaction.p_start_addr                      = (uint32_t*) start_address;
                m_transaction.length                            = p_packet->payload.start.length * 4;
                m_transaction.signature_length                  = p_packet->payload.start.signature_length;
                m_transaction.segment_is_valid_after_transfer   = p_packet->payload.start.last;
                m_transaction.p_last_requested_entry            = NULL;
                m_transaction.signature_bitmap                  = 0;

                __LOG("SEGMENT START: 0x%x\n", p_segment->start);

                /* If no one specified a bank, we either have to do it single-banked or find a bank */
                if (m_transaction.p_bank_addr == (uint32_t*) 0xFFFFFFFF)
                {
                    if (m_transaction.type == DFU_TYPE_BOOTLOADER)
                    {
                        /* Place bootloader bank at end of app section */
                        m_transaction.p_bank_addr = (uint32_t*) (
                            (m_bl_info_pointers.p_segment_app->start) +
                            (m_bl_info_pointers.p_segment_app->length) -
                            (m_transaction.length & ((uint32_t) ~(PAGE_SIZE - 1))) -
                            (PAGE_SIZE)
                        );

                    }
                    else
                    {
                        /* others will be inline. */
                        __LOG("Bank: 0x%x\n", m_transaction.p_start_addr);
                        m_transaction.p_bank_addr = m_transaction.p_start_addr;
                    }
                }

                __LOG("Set transaction parameters:\n");
                __LOG("\ttype:       %s\n", m_dfu_type_strs[(uint32_t) m_transaction.type]);
                __LOG("\tsegments:   %u\n", segment_count);
                __LOG("\tstart addr: 0x%x\n", start_address);
                __LOG("\tbank addr:  0x%x\n", m_transaction.p_bank_addr);
                __LOG("\tlength:     %u\n", m_transaction.length);
                __LOG("\tsigned:     %s\n", m_transaction.signature_length > 0 ? "YES" : "NO");

                if ((uint32_t) m_transaction.p_start_addr >= p_segment->start &&
                    (uint32_t) m_transaction.p_start_addr + m_transaction.length <= p_segment->start + p_segment->length)
                {
                    start_target();
                    do_relay = true;
                }
            }
            else
            {
                __LOG("ERROR: Received non-0 segment.\n");
                m_tid_cache[(m_tid_index++) & (TRANSACTION_ID_CACHE_SIZE - 1)] = m_transaction.transaction_id;
                start_req(m_transaction.type, &m_transaction.target_fwid_union); /* go back to req, we've missed packet 0 */
            }
        }
        else if (m_state == DFU_STATE_DFU_TARGET)
        {
            if (p_packet->payload.data.segment > 0 &&
                p_packet->payload.data.segment <= m_transaction.segment_count)
            {
                uint32_t* p_addr = NULL;
                uint32_t error_code = NRF_ERROR_NULL;

                if (p_packet->payload.data.segment <=
                    m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH)
                {
                    p_addr = addr_from_seg(p_packet->payload.data.segment);
                    error_code  = dfu_transfer_data((uint32_t) p_addr,
                                               p_packet->payload.data.data,
                                               length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));
                }
                else /* treat signature packets at the end */
                {
                    uint32_t index = p_packet->payload.data.segment - (m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH) - 1;
                    if (index >= m_transaction.signature_length / SEGMENT_LENGTH ||
                        m_transaction.signature_bitmap & (1 << index))
                    {
                        error_code = NRF_ERROR_INVALID_STATE;
                    }
                    else
                    {
                        memcpy(&m_transaction.signature[index * SEGMENT_LENGTH],
                               p_packet->payload.data.data,
                               length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));

