NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
                        __LOG("Signature packet #%u\n", index);
                        m_transaction.signature_bitmap |= (1 << index);
                        error_code = NRF_SUCCESS;
                    }
                }

                if (error_code == NRF_SUCCESS)
                {
                    keep_alive();
                    m_transaction.segments_remaining--;
                    do_relay = true;
                    /* check whether we've lost any entries, and request them */
                    uint32_t* p_req_entry = NULL;
                    uint32_t req_entry_len = 0;

                    if (dfu_transfer_get_oldest_missing_entry(
                            m_transaction.p_last_requested_entry,
                            &p_req_entry,
                            &req_entry_len) &&
                        (
                         /* don't request the previous packet yet */
                         ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr) < p_packet->payload.data.segment - 1 ||
                         m_transaction.segment_count == p_packet->payload.data.segment
                        )
                       )
                    {
                        dfu_packet_t req_packet;
                        req_packet.packet_type = DFU_PACKET_TYPE_DATA_REQ;
                        req_packet.payload.req_data.segment = ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr);
                        req_packet.payload.req_data.transaction_id = m_transaction.transaction_id;
                        __LOG("TX REQ for #%u\n", req_packet.payload.req_data.segment);

                        packet_tx_dynamic(&req_packet, DFU_PACKET_LEN_DATA_REQ, TX_INTERVAL_TYPE_REQ, TX_REPEATS_REQ);
                        m_transaction.p_last_requested_entry = (uint32_t*) p_req_entry;
                    }
                }
            }

            /* ending the DFU */
            if (m_transaction.segments_remaining == 0)
            {
                dfu_transfer_end();
                start_rampdown();
            }
        }
        else if (m_state == DFU_STATE_RELAY_CANDIDATE ||
                 m_state == DFU_STATE_RELAY)
        {
            SET_STATE(DFU_STATE_RELAY);
            tx_abort(TX_SLOT_BEACON);
            keep_alive();
            do_relay = true;
        }
    }

    packet_cache_put(p_packet);

    if (do_relay)
    {
        relay_packet(p_packet, length);
    }
}

static void handle_state_packet(dfu_packet_t* p_packet)
{
    __LOG("RX STATE PACKET\n");
#ifdef BL_LOG
    __LOG("\tType: %s\n", m_dfu_type_strs[p_packet->payload.state.dfu_type]);
    switch (p_packet->payload.state.dfu_type)
    {
        case DFU_TYPE_APP:
            __LOG("\tOur version: %x.%x.%x\n",
                    (uint32_t) m_bl_info_pointers.p_fwid->app.company_id,
                    (uint32_t) m_bl_info_pointers.p_fwid->app.app_id,
                    (uint32_t) m_bl_info_pointers.p_fwid->app.app_version);
            __LOG("\tTheir version: %x.%x.%x\n",
                    (uint32_t) p_packet->payload.state.fwid.app.company_id,
                    (uint32_t) p_packet->payload.state.fwid.app.app_id,
                    (uint32_t) p_packet->payload.state.fwid.app.app_version);
            break;
        case DFU_TYPE_SD:
            __LOG("\tOur version: %x\n",
                    (uint32_t) m_bl_info_pointers.p_fwid->sd);
            __LOG("\tTheir version: %x\n",
                    (uint32_t) p_packet->payload.state.fwid.sd);
            break;
        case DFU_TYPE_BOOTLOADER:
            __LOG("\tOur version: %x.%x\n",
                    (uint32_t) m_bl_info_pointers.p_fwid->bootloader.id,
                    (uint32_t) m_bl_info_pointers.p_fwid->bootloader.ver);
            __LOG("\tTheir version: %x.%x\n",
                    (uint32_t) p_packet->payload.state.fwid.bootloader.id,
                    (uint32_t) p_packet->payload.state.fwid.bootloader.ver);
            break;
        default:
            break;
    }
#endif

    switch (m_state)
    {
        case DFU_STATE_FIND_FWID:
            if (p_packet->payload.state.authority > 0)
            {
                m_transaction.type = (dfu_type_t) p_packet->payload.state.dfu_type;
                m_transaction.target_fwid_union = p_packet->payload.state.fwid;

                if (ready_packet_is_upgrade(p_packet))
                {
                    __LOG("\t->Upgradeable\n");
                    bl_evt_t fw_evt;
                    fw_evt.type = BL_EVT_TYPE_NEW_FW;
                    fw_evt.params.new_fw.fw_type = (dfu_type_t) p_packet->payload.state.dfu_type;
                    memcpy(&fw_evt.params.new_fw.fwid, &p_packet->payload.state.fwid, sizeof(fwid_union_t));
                    bootloader_evt_send(&fw_evt);
                }
                else
                {
                    __LOG("\t->Relayable\n");
                    /* we can relay this transfer */
                    bl_evt_t relay_req_evt;
                    relay_req_evt.type = BL_EVT_TYPE_REQ_RELAY;
                    relay_req_evt.params.req.dfu_type = (dfu_type_t) p_packet->payload.state.dfu_type;
                    relay_req_evt.params.req.fwid = p_packet->payload.state.fwid;
                    bootloader_evt_send(&relay_req_evt);
                }
            }
            else
            {
                //TODO
                //handle relaying of requests
            }
            break;
        case DFU_STATE_DFU_REQ:
            if (p_packet->payload.state.authority > 0)
            {
                if (ready_packet_matches_our_req(p_packet) ||
                    ready_packet_is_upgrade(p_packet))
                {
                    __LOG("\t->Upgradeable\n");
                    /* assume that the other device knows what to upgrade */
                    m_transaction.type = (dfu_type_t) p_packet->payload.state.dfu_type;
                    m_transaction.target_fwid_union = p_packet->payload.state.fwid;

                    start_ready(p_packet);
                }
                else
                {
                    __LOG("\t->Relayable\n");
                    /* we can relay this transfer, let the app decide whether we should abort our request. */
                    bl_evt_t relay_req_evt;
                    relay_req_evt.type = BL_EVT_TYPE_REQ_RELAY;
                    relay_req_evt.params.req.dfu_type = (dfu_type_t) p_packet->payload.state.dfu_type;
                    relay_req_evt.params.req.fwid = p_packet->payload.state.fwid;
                    bootloader_evt_send(&relay_req_evt);
                }
            }
            break;
        case DFU_STATE_DFU_READY:
            if (ready_packet_matches_our_req(p_packet))
            {
                if (p_packet->payload.state.authority > m_transaction.authority ||
                    (
                     p_packet->payload.state.authority == m_transaction.authority &&
                     p_packet->payload.state.transaction_id > m_transaction.transaction_id
                    )
                   )
                {
                    __LOG("\tHigher authority (%u)\n", p_packet->payload.state.authority);
                    m_transaction.authority = p_packet->payload.state.authority;
                    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
                    beacon_set(state_beacon_type(m_transaction.type));
                }
            }
            break;
        case DFU_STATE_RELAY_CANDIDATE:
            if (m_transaction.type == p_packet->payload.state.dfu_type &&
                fwid_union_cmp(&m_transaction.target_fwid_union, &p_packet->payload.state.fwid, m_transaction.type))
            {
                if (m_transaction.authority < p_packet->payload.state.authority ||
                    (m_transaction.authority      == p_packet->payload.state.authority &&
                     m_transaction.transaction_id <  p_packet->payload.state.transaction_id))
                {
                    __LOG("\tHigher authority (%u)\n", p_packet->payload.state.authority);
                    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
                    m_transaction.authority      = p_packet->payload.state.authority;
                    beacon_set(state_beacon_type(m_transaction.type));
                }
            }
            break;
        default:
            break;
    }

