NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
}

static void handle_fwid_packet(dfu_packet_t* p_packet)
{
    __LOG("RX FWID\n");
    if (m_state == DFU_STATE_FIND_FWID)
    {
        /* always upgrade bootloader first */
        if (bootloader_is_newer(p_packet->payload.fwid.bootloader))
        {
            __LOG("\tBootloader upgrade possible\n");
            bl_evt_t fwid_evt;
            fwid_evt.type = BL_EVT_TYPE_NEW_FW;
            fwid_evt.params.new_fw.fw_type = DFU_TYPE_BOOTLOADER;
            fwid_evt.params.new_fw.fwid.bootloader.id  = p_packet->payload.fwid.bootloader.id;
            fwid_evt.params.new_fw.fwid.bootloader.ver = p_packet->payload.fwid.bootloader.ver;
            bootloader_evt_send(&fwid_evt);
        }
        else if (app_is_newer(&p_packet->payload.fwid.app))
        {
            /* SD shall only be upgraded if a newer version of our app requires a different SD */
            if (p_packet->payload.fwid.sd != 0xFFFE && p_packet->payload.fwid.sd != m_bl_info_pointers.p_fwid->sd)
            {
                __LOG("\tSD upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_NEW_FW;
                fwid_evt.params.new_fw.fw_type = DFU_TYPE_SD;
                fwid_evt.params.new_fw.fwid.sd = p_packet->payload.fwid.sd;
                bootloader_evt_send(&fwid_evt);
            }
            else
            {
                __LOG("\tApp upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_NEW_FW;
                fwid_evt.params.new_fw.fw_type = DFU_TYPE_APP;
                memcpy(&fwid_evt.params.new_fw.fwid.app, &p_packet->payload.fwid.app, sizeof(app_id_t));
                bootloader_evt_send(&fwid_evt);
            }
        }
    }
}

static void handle_data_req_packet(dfu_packet_t* p_packet)
{
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        __LOG("RX data REQ #%u\n", p_packet->payload.data.segment);
        if (m_state == DFU_STATE_RELAY)
        {
            /* only relay new packets, look for it in cache */
            if (!packet_in_cache(p_packet))
            {
                keep_alive();
                relay_packet(p_packet, 8);
            }
        }
        else
        {
            req_cache_entry_t* p_req_entry = NULL;
            /* check that we haven't served this request recently. */
            for (uint32_t i = 0; i < REQ_CACHE_SIZE; ++i)
            {
                if (m_req_cache[i].segment == p_packet->payload.req_data.segment)
                {
                    if (m_req_cache[i].rx_count++ < REQ_RX_COUNT_RETRY)
                    {
                        return;
                    }
                    p_req_entry = &m_req_cache[i];
                    break;
                }
            }
            /* serve request */
            dfu_packet_t dfu_rsp;
            if (
                dfu_transfer_has_entry(
                    (uint32_t*) SEGMENT_ADDR(p_packet->payload.req_data.segment, m_transaction.p_start_addr),
                    dfu_rsp.payload.rsp_data.data, SEGMENT_LENGTH)
               )
            {
                dfu_rsp.packet_type = DFU_PACKET_TYPE_DATA_RSP;
                dfu_rsp.payload.rsp_data.segment = p_packet->payload.req_data.segment;
                dfu_rsp.payload.rsp_data.transaction_id = p_packet->payload.req_data.transaction_id;

                packet_tx_dynamic(&dfu_rsp, DFU_PACKET_LEN_DATA_RSP, TX_INTERVAL_TYPE_RSP, TX_REPEATS_RSP);

                /* reset time to allow for more updates */
                keep_alive();
            }

            /* log our attempt at responding */
            if (!p_req_entry)
            {
                p_req_entry = &m_req_cache[(m_req_index++) & (REQ_CACHE_SIZE - 1)];
                p_req_entry->segment = p_packet->payload.req_data.segment;
            }
            p_req_entry->rx_count = 0;
        }
    }
}

static void handle_data_rsp_packet(dfu_packet_t* p_packet, uint16_t length)
{
    if (m_state == DFU_STATE_RELAY)
    {
        /* only relay new packets, look for it in cache */
        if (!packet_in_cache(p_packet))
        {
            keep_alive();
            relay_packet(p_packet, length);
        }
    }
    else
    {
        handle_data_packet(p_packet, length);
    }
}

static bool fw_is_verified(void)
{
    bl_info_entry_t* p_flag_entry = bootloader_info_entry_get(BL_INFO_TYPE_FLAGS);
    if (p_flag_entry)
    {
        return (p_flag_entry->flags.sd_intact &&
                p_flag_entry->flags.app_intact &&
                p_flag_entry->flags.bl_intact);
    }

    return true;
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/

void dfu_mesh_init(uint8_t tx_slots)
{
    SET_STATE(DFU_STATE_FIND_FWID);
    m_transaction.transaction_id = 0;
    m_transaction.type = DFU_TYPE_NONE;
    memset(m_req_cache, 0, REQ_CACHE_SIZE * sizeof(m_req_cache[0]));
    memset(m_tid_cache, 0, TRANSACTION_ID_CACHE_SIZE);
    memset(m_packet_cache, 0, PACKET_CACHE_SIZE * sizeof(packet_cache_entry_t));
    m_tid_index = 0;
    m_packet_cache_index = 0;
    m_req_index = 0;
    m_tx_slots = tx_slots;

    /* fetch persistent entries */
    m_bl_info_pointers.p_flags              = &bootloader_info_entry_get(BL_INFO_TYPE_FLAGS)->flags;
    m_bl_info_pointers.p_fwid               = &bootloader_info_entry_get(BL_INFO_TYPE_VERSION)->version;
    m_bl_info_pointers.p_segment_app        = &bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_APP)->segment;
    m_bl_info_pointers.p_segment_bl         = &bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_BL)->segment;
    m_bl_info_pointers.p_segment_sd         = &bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_SD)->segment;
    m_bl_info_pointers.p_ecdsa_public_key   = &bootloader_info_entry_get(BL_INFO_TYPE_ECDSA_PUBLIC_KEY)->public_key[0];

    if (
        ((uint32_t) m_bl_info_pointers.p_flags              < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_fwid               < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_app        < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_sd         < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_bl         < BOOTLOADER_INFO_ADDRESS)
       )
    {
        __LOG("Missing a critical info pointer\n");
        send_abort_evt(DFU_END_ERROR_INVALID_PERSISTENT_STORAGE);
    }
}

void dfu_mesh_start(void)
{
    __LOG("Mesh start: \n");
    __LOG("\tAPP: %08x.%04x:%08x\n",
            (uint32_t) m_bl_info_pointers.p_fwid->app.company_id,
            (uint32_t) m_bl_info_pointers.p_fwid->app.app_id,
            (uint32_t) m_bl_info_pointers.p_fwid->app.app_version);
    __LOG("\tSD:  %04x\n",
            (uint32_t) m_bl_info_pointers.p_fwid->sd);
    __LOG("\tBL:  %02x:%02x\n",
            (uint32_t) m_bl_info_pointers.p_fwid->bootloader.id,
            (uint32_t) m_bl_info_pointers.p_fwid->bootloader.ver);

    const bl_info_type_t bank_types[] = {BL_INFO_TYPE_BANK_BL, BL_INFO_TYPE_BANK_SD, BL_INFO_TYPE_BANK_APP};
    const dfu_type_t dfu_types[] = {DFU_TYPE_BOOTLOADER, DFU_TYPE_SD, DFU_TYPE_APP};
    const void* p_curr_fwid[] = {&m_bl_info_pointers.p_fwid->bootloader, (void*) &m_bl_info_pointers.p_fwid->sd, &m_bl_info_pointers.p_fwid->app};

    /* check for available banks */
    for (uint32_t i = 0; i < 3; ++i)
    {
        bl_info_entry_t* p_bank_entry = bootloader_info_entry_get(bank_types[i]);
        if (p_bank_entry)
        {
            __LOG("Bank available: %s\n", m_dfu_type_strs[dfu_types[i]]);
            if (fwid_union_cmp(&p_bank_entry->bank.fwid, (fwid_union_t*) p_curr_fwid[i], dfu_types[i]))
            {
                bl_evt_t bank_evt;
                bank_evt.type = BL_EVT_TYPE_BANK_AVAILABLE;
                bank_evt.params.bank_available.bank_dfu_type = dfu_types[i];
                memcpy(&bank_evt.params.bank_available.bank_fwid, &p_bank_entry->bank.fwid, sizeof(fwid_union_t));
                memcpy(&bank_evt.params.bank_available.current_fwid, (fwid_union_t*) p_curr_fwid[i], sizeof(fwid_union_t));
                bank_evt.params.bank_available.p_bank_addr = p_bank_entry->bank.p_bank_addr;
                bank_evt.params.bank_available.bank_length = p_bank_entry->bank.length;
                bootloader_evt_send(&bank_evt);
            }
        }
    }

    start_find_fwid();
}

uint32_t dfu_mesh_req(dfu_type_t type, fwid_union_t* p_fwid, uint32_t* p_bank_addr)
{
    if (m_state != DFU_STATE_FIND_FWID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    __LOG("REQUESTING TRANSFER OF %s\n", m_dfu_type_strs[(uint32_t) type]);
    m_transaction.p_bank_addr = p_bank_addr;
    start_req(type, p_fwid);

    return NRF_SUCCESS;
}

uint32_t dfu_mesh_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
#ifdef DEBUG_LEDS
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = (1 << 22);
    }
    else
    {
        NRF_GPIO->OUTSET = (1 << 22);
    }
    led = !led;
    NRF_GPIO->OUTSET = (1 << 1);
#endif

    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            handle_data_packet(p_packet, length);
            break;

