NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
        case DFU_PACKET_TYPE_DATA_REQ:
            handle_data_req_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA_RSP:
            handle_data_rsp_packet(p_packet, length);
            break;

        default:
            /* don't care */
            break;
    }
#ifdef DEBUG_LEDS
    NRF_GPIO->OUTCLR = (1 << 1);
#endif
    return NRF_SUCCESS;
}

void dfu_mesh_timeout(void)
{
    __LOG("TIMEOUT\n");
    switch (m_state)
    {
        case DFU_STATE_FIND_FWID:
            send_abort_evt(DFU_END_FWID_VALID);
            break;

        case DFU_STATE_DFU_REQ:
        case DFU_STATE_DFU_READY:
            send_abort_evt(DFU_END_ERROR_NO_START);
            break;

        case DFU_STATE_DFU_TARGET:
            start_req(m_transaction.type, &m_transaction.target_fwid_union);
            break;

        case DFU_STATE_VALIDATE:
            if (signature_check())
            {
                dfu_mesh_finalize();

                bl_evt_t end_evt;
                end_evt.type = BL_EVT_TYPE_END_TARGET;
                end_evt.params.end.dfu_type = m_transaction.type;
                memcpy(&end_evt.params.end.fwid, &m_transaction.target_fwid_union, sizeof(fwid_union_t));
                bootloader_evt_send(&end_evt);
            }
            else
            {
                /* someone gave us unauthorized firmware */
                send_abort_evt(DFU_END_ERROR_UNAUTHORIZED);
            }
            break;
        case DFU_STATE_RELAY:
        case DFU_STATE_RELAY_CANDIDATE:
            send_abort_evt(DFU_END_SUCCESS);
            break;
        default:
            break;
    }
}

dfu_type_t dfu_mesh_missing_type_get(void)
{
    bl_info_entry_t* p_fwid_entry = bootloader_info_entry_get(BL_INFO_TYPE_VERSION);
    bl_info_entry_t* p_flag_entry = bootloader_info_entry_get(BL_INFO_TYPE_FLAGS);
    bl_info_entry_t* p_sd_seg_entry = bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_SD);
    bl_info_entry_t* p_app_seg_entry = bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_APP);
    if (p_fwid_entry->version.sd != SD_VERSION_INVALID) /* only check for SD if we need it. */
    {
        if (!p_flag_entry->flags.sd_intact || *((uint32_t*) p_sd_seg_entry->segment.start) == 0xFFFFFFFF)
        {
            return DFU_TYPE_SD;
        }
    }

    if (!p_flag_entry->flags.app_intact || *((uint32_t*) p_app_seg_entry->segment.start) == 0xFFFFFFFF)
    {
        return DFU_TYPE_APP;
    }

    return DFU_TYPE_NONE;
}

bool dfu_mesh_app_is_valid(void)
{
    bl_info_entry_t* p_fwid_entry = bootloader_info_entry_get(BL_INFO_TYPE_VERSION);

    return (p_fwid_entry != NULL &&
            (uint32_t*) m_bl_info_pointers.p_segment_app->start != (uint32_t*) 0xFFFFFFFF &&
            *((uint32_t*) m_bl_info_pointers.p_segment_app->start) != 0xFFFFFFFF &&
            p_fwid_entry->version.app.app_version != APP_VERSION_INVALID &&
            fw_is_verified());
}

uint32_t dfu_mesh_finalize(void)
{
    __LOG("Finalize\n");
    /* write new version in bl info: */
    bl_info_entry_t new_version_entry;
    memcpy(&new_version_entry.version, m_bl_info_pointers.p_fwid, sizeof(fwid_t));
    bl_info_type_t sign_info_type = BL_INFO_TYPE_INVALID;

    if (m_transaction.p_bank_addr != m_transaction.p_start_addr) /* Dual bank! */
    {
        bl_info_entry_t bank_entry;
        memcpy(&bank_entry.bank.fwid, &m_transaction.target_fwid_union, sizeof(fwid_union_t));
        bank_entry.bank.length = m_transaction.length;
        bank_entry.bank.p_bank_addr = m_transaction.p_bank_addr;
        bank_entry.bank.state = BL_INFO_BANK_STATE_IDLE;

        uint32_t entry_length = BL_INFO_LEN_BANK;

        if (m_transaction.signature_length > 0)
        {
            memcpy(bank_entry.bank.signature, m_transaction.signature, BL_INFO_LEN_SIGNATURE);
            bank_entry.bank.has_signature = true;
            entry_length = BL_INFO_LEN_BANK_SIGNED;
        }

        switch (m_transaction.type)
        {
            case DFU_TYPE_APP:
                bootloader_info_entry_put(BL_INFO_TYPE_BANK_APP, &bank_entry, entry_length);
                break;
            case DFU_TYPE_BOOTLOADER:
                bootloader_info_entry_put(BL_INFO_TYPE_BANK_BL, &bank_entry, entry_length);
                break;
            case DFU_TYPE_SD:
                bootloader_info_entry_put(BL_INFO_TYPE_BANK_SD, &bank_entry, entry_length);
                break;
            default:
                return NRF_ERROR_INVALID_DATA;
        }
        __LOG("Bank info stored.\n");
    }
    else
    {
        if (m_bl_info_pointers.p_flags == NULL)
        {
            APP_ERROR_CHECK(NRF_ERROR_NULL);
        }

        /* copy flags, then mark the type we just verified as intact before reflashing it. */
        bl_info_entry_t flags_entry;
        memcpy(&flags_entry, m_bl_info_pointers.p_flags, ((BL_INFO_LEN_FLAGS + 3) & ~0x03UL));

        switch (m_transaction.type)
        {
            case DFU_TYPE_APP:
                memcpy((void*) &new_version_entry.version.app,
                       (void*) &m_transaction.target_fwid_union.app,
                       DFU_FWID_LEN_APP);
                sign_info_type = BL_INFO_TYPE_SIGNATURE_APP;
                flags_entry.flags.app_intact = true;
                break;
            case DFU_TYPE_SD:
                memcpy((void*) &new_version_entry.version.sd,
                       (void*) &m_transaction.target_fwid_union.sd,
                       DFU_FWID_LEN_SD);
                sign_info_type = BL_INFO_TYPE_SIGNATURE_SD;
                flags_entry.flags.sd_intact = true;
                break;
            case DFU_TYPE_BOOTLOADER:
                memcpy((void*) &new_version_entry.version.bootloader,
                       (void*) &m_transaction.target_fwid_union.bootloader,
                       DFU_FWID_LEN_BL);
                sign_info_type = BL_INFO_TYPE_SIGNATURE_BL;
                flags_entry.flags.bl_intact = true;
                break;
            default:
                break;
        }
        /* add signature to bl info, if applicable: */
        if (m_transaction.signature_length != 0)
        {
            bootloader_info_entry_put(sign_info_type, (bl_info_entry_t*) m_transaction.signature, DFU_SIGNATURE_LEN);
        }

        __LOG("VERSION: ");
        for (uint32_t i = 0; i < BL_INFO_LEN_FWID; ++i)
        {
            __LOG("%02x", ((uint8_t*) &new_version_entry)[i]);
        }
        __LOG("\n");
        m_bl_info_pointers.p_fwid  = &bootloader_info_entry_put(BL_INFO_TYPE_VERSION, &new_version_entry, BL_INFO_LEN_FWID)->version;
        m_bl_info_pointers.p_flags = &bootloader_info_entry_put(BL_INFO_TYPE_FLAGS, &flags_entry, BL_INFO_LEN_FLAGS)->flags;
        __LOG("Single bank meta stored.\n");
    }

    __LOG(RTT_CTRL_TEXT_GREEN RTT_CTRL_BG_RED "Transfer complete!" RTT_CTRL_RESET "\n");
    /* Reset the bootloader info page to make room for the next transfer. */
    bootloader_info_reset();
    dfu_mesh_start();
    return NRF_SUCCESS;
}

void dfu_mesh_restart(void)
{
    __LOG("Restart\n");
    start_find_fwid();
}

